API - Copy/APITest3/Log/vtd_user.log

2023-01-13 20:04:16,653 [1] INFO  - Loaded appender: FileAppenderExternal
2023-01-13 20:04:16,662 [1] INFO  - Loaded appender: UserLoggerAppender
2023-01-13 20:04:16,663 [1] INFO  - Loaded appender: FileAppenderInternal
2023-01-13 20:04:16,664 [1] INFO  - Loaded appender: FileAppenderExternal
2023-01-13 20:04:16,664 [1] INFO  - Loaded appender: UserLoggerAppender
2023-01-13 20:04:16,664 [1] INFO  - Loaded appender: FileAppenderInternal
2023-01-13 20:04:16,928 [17] INFO  - Step 'Start' : Step 'Start' started
2023-01-13 20:04:16,962 [17] INFO  - Step 'Start' ended successfully
2023-01-13 20:04:16,963 [17] INFO  - Step 'Test Flow' : Step 'Test Flow' started
2023-01-13 20:04:16,965 [17] INFO  - Step 'Iteration 1' : Step 'Iteration 1' started
2023-01-13 20:04:16,968 [17] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2023-01-13 20:04:16,977 [17] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Los Angeles</ArrivalCity>
      <FlightDate>2023-01-31T00:00:00+00:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2023-01-13 20:04:16,990 [17] INFO  - URL: http://localhost:8000/Flights_SOAP
2023-01-13 20:04:17,008 [17] INFO  - Returning the response to the previous channel
2023-01-13 20:04:17,012 [17] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>03:54 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>02:57 PM</DepartureTime>
          <FlightNumber>1159</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>07:30 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>06:33 PM</DepartureTime>
          <FlightNumber>1513</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>01:30 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:33 PM</DepartureTime>
          <FlightNumber>2059</FlightNumber>
          <Price>122</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>11:06 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:09 AM</DepartureTime>
          <FlightNumber>5385</FlightNumber>
          <Price>104.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>05:06 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>04:09 PM</DepartureTime>
          <FlightNumber>5595</FlightNumber>
          <Price>132</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>02:42 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>01:45 PM</DepartureTime>
          <FlightNumber>5988</FlightNumber>
          <Price>123.6</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>01:24 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>6200</FlightNumber>
          <Price>171.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>03:48 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>6204</FlightNumber>
          <Price>175.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>06:12 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>6208</FlightNumber>
          <Price>179.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>06:18 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:21 PM</DepartureTime>
          <FlightNumber>9270</FlightNumber>
          <Price>100.4</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>12:18 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>11:21 AM</DepartureTime>
          <FlightNumber>9400</FlightNumber>
          <Price>126.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2023-01-13 20:04:17,028 [17] INFO  - Structural Validation: True
2023-01-13 20:04:17,034 [17] INFO  - Step 'GetFlights' ended successfully
2023-01-13 20:04:17,035 [17] INFO  - Step 'Iteration 1' ended successfully
2023-01-13 20:04:17,037 [17] INFO  - Step 'Test Flow' ended successfully
2023-01-13 20:04:17,038 [17] INFO  - Step 'End' : Step 'End' started
2023-01-13 20:04:17,044 [17] INFO  - Step 'End' ended successfully
